"""3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y=kx+b,
проходящей через эти точки."""


print('Введите координаты точки А(х1, у1): ')
x1 = float(input('Введите х1 = '))
y1 = float(input('Введите у1 = '))

print('Введите координаты точки В(х2, у2): ')
x2 = float(input('Введите x2 = '))
y2 = float(input('Введите у2 = '))

if x1 == x2 and y1 == y2:
    print('Положение точек идентично. ')
elif x1 == x2:
    print(f'x = {x1:.2f}')
else:
    k = (y1 - y2) / (x1 - x2)
    b = y2 - k * x2
    print(f"y = {k:.2f}x {'-' if b < 0 else '+'} {abs(b):.2f}")
